core/testdata/siri-service-multiple-request-soap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://www.siri.org.uk/siri" xmlns:m1="http://www.ifopt.org.uk/acsb">
  <SOAP-ENV:Body>
    <m:GetSiriService xmlns:m="http://wsdl.siri.org.uk">
      <Request>
        <m0:ServiceRequestContext>
        </m0:ServiceRequestContext>
        <m0:RequestTimestamp>2001-12-17T09:30:47Z</m0:RequestTimestamp>
        <m0:RequestorRef>RATPDev:Concerto</m0:RequestorRef>
        <m0:MessageIdentifier>GetSIRIStopMonitoring:Test:0</m0:MessageIdentifier>
        <m0:DelegatorRef/>
        <m0:StopMonitoringRequest version="2.0:FR-IDF-2.4">
          <m0:RequestTimestamp>2017-01-10T16:30:47Z</m0:RequestTimestamp>
          <m0:MessageIdentifier>GetSIRIStopMonitoring:Test:0</m0:MessageIdentifier>
          <m0:MonitoringRef>boaarle</m0:MonitoringRef>
          <m0:StopVisitTypes>all</m0:StopVisitTypes>
        </m0:StopMonitoringRequest>
        <m0:GeneralMessageRequest version="2.0:FR-IDF-2.4">
          <m0:RequestTimestamp>2017-01-10T16:30:47Z</m0:RequestTimestamp>
          <m0:MessageIdentifier>GetSIRIGeneralMessage:Test:0</m0:MessageIdentifier>
          <ns2:Extensions>
            <ns6:IDFGeneralMessageRequestFilter>
            </ns6:IDFGeneralMessageRequestFilter>
          </ns2:Extensions>
        </m0:GeneralMessageRequest>
        <m0:EstimatedTimetableRequest version="2.0:FR-IDF-2.4">
          <ns2:RequestTimestamp>2017-01-01T12:00:00.000+02:00</ns2:RequestTimestamp>
          <ns2:MessageIdentifier>GetSIRIEstimatedTimetable:Test:0</ns2:MessageIdentifier>
          <ns2:Lines>
            <ns2:LineRef>NINOXE:Line:3:LOC</ns2:LineRef>
          </ns2:Lines>
        </m0:EstimatedTimetableRequest>
      </Request>
    </m:GetSiriService>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>