features/testdata/checkstatus-soap-request.xml

<?xml version='1.0' encoding='utf-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
						xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ns7:CheckStatus xmlns:ns2="http://www.siri.org.uk/siri"
										 xmlns:ns3="http://www.ifopt.org.uk/acsb"
										 xmlns:ns4="http://www.ifopt.org.uk/ifopt"
										 xmlns:ns5="http://datex2.eu/schema/2_0RC1/2_0"
										 xmlns:ns6="http://scma/siri" xmlns:ns7="http://wsdl.siri.org.uk">
			<Request>
				<ns2:RequestTimestamp>2017-01-01T12:00:00.OOOZ</ns2:RequestTimestamp>
				<ns2:RequestorRef>Edwig:cucumber</ns2:RequestorRef>
				<ns2:MessageIdentifier>CheckStatus:Test:0</ns2:MessageIdentifier>
			</Request>
			<RequestExtension />
		</ns7:CheckStatus>
	</S:Body>
</S:Envelope>